# Combining Dataframe

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'Name': ['Vicky','Bill'], 'Age': [12, 45]})
df2 = pd.DataFrame({'Name': ['John','Sabrina'], 'Age':[37, 25]})
df1

    Name  Age
0  Vicky   12
1   Bill   45

In [3]:
df2

      Name  Age
0     John   37
1  Sabrina   25

In [4]:
# Concate Horizontally

pd.concat([df1 , df2], axis = 1)

    Name  Age     Name  Age
0  Vicky   12     John   37
1   Bill   45  Sabrina   25

In [6]:
# Concat Vertically and ignore inndex

df3 = pd.concat([df1 , df2], axis = 0)
df3

      Name  Age
0    Vicky   12
1     Bill   45
0     John   37
1  Sabrina   25

In [7]:
df4 = pd.DataFrame({'Name': ['Tyler','Natalie'], 'Age': [28, 39], 'Hobby': ['Swimming' , 'Reading']})
df4

      Name  Age     Hobby
0    Tyler   28  Swimming
1  Natalie   39   Reading

In [8]:
# Outer is the default for the join argument

pd.concat([df3 , df4], join = 'outer', ignore_index = True)

      Name  Age     Hobby
0    Vicky   12       NaN
1     Bill   45       NaN
2     John   37       NaN
3  Sabrina   25       NaN
4    Tyler   28  Swimming
5  Natalie   39   Reading

In [9]:
# inner stacks only the column that are shared between the two dataframe

pd.concat([df3 , df4], join = 'inner', ignore_index = True)

      Name  Age
0    Vicky   12
1     Bill   45
2     John   37
3  Sabrina   25
4    Tyler   28
5  Natalie   39

# MERGE Function

In [12]:
size = pd.DataFrame({ 'Colour': ['Red', 'Blue', 'Green'], 'Size': ['M', 'S', 'M']})
gender = pd.DataFrame({ 'Colour' : ['Red', 'Blue', 'Yellow'], 'Sex': ['Female', 'Female', 'Male']})
size

  Colour Size
0    Red    M
1   Blue    S
2  Green    M

In [13]:
gender

   Colour     Sex
0     Red  Female
1    Blue  Female
2  Yellow    Male

In [14]:
# only shows rows where there is a match in a column

pd.merge(size, gender, how = 'inner')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female

In [15]:
# outer merge

pd.merge(size, gender, how = 'outer')

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2   Green    M     NaN
3  Yellow  NaN    Male

In [16]:
# left function 

pd.merge(size, gender, how = 'left')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female
2  Green    M     NaN

In [17]:
# right merge

pd.merge(size, gender, how = 'right')

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2  Yellow  NaN    Male

In [18]:
# comcat shows match data